Bwooce/tinygs_nRF52/src/main.cpp
/* -------------------------------------------------------------------------- */
/* Status LED (green, P1.03, active low)                                       */
/* -------------------------------------------------------------------------- */

static const struct gpio_dt_spec status_led = GPIO_DT_SPEC_GET(DT_ALIAS(led0), gpios);

#if defined(CONFIG_LED_STRIP)
static const struct device *led_strip = DEVICE_DT_GET_OR_NULL(DT_ALIAS(led_strip));
static struct led_rgb leds[2] = {{0}, {0}};
#else
static const void *led_strip = NULL;
#endif

static void led_init(void)
{
    /* Don't configure P1.03 as GPIO — PWM0 will own this pin for breathing LED.
     * The GPIO config would conflict with the PWM peripheral. */
#if defined(CONFIG_LED_STRIP)
    if (led_strip && device_is_ready(led_strip)) {
        /* Clear NeoPixels immediately — bootloader may have left them lit */
        struct led_rgb off[2] = {{0}, {0}};
        led_strip_update_rgb(led_strip, off, 2);
        LOG_INF("NeoPixel: 2x SK6812/WS2812 cleared");
    } else {
        led_strip = NULL;
    }
#endif
}

/* -------------------------------------------------------------------------- */
/* Breathing LED — nRF PWM hardware sequence, zero CPU                         */
/* -------------------------------------------------------------------------- */

#include <nrfx_pwm.h>
#include <hal/nrf_gpio.h>

static nrfx_pwm_t pwm_led = NRFX_PWM_INSTANCE(0);
static bool pwm_breathing = false;

/* Breathing LED: one gentle pulse, then 25s off, repeat.
 * Uses PWM event handler + k_timer for the pause (end_delay doesn't
 * work with NRFX_PWM_FLAG_LOOP). */
#define BREATH_MAX_DUTY  50    /* 5% max brightness */
#define BREATH_STEPS     64
#define BREATH_PAUSE_S   25    /* Seconds between pulses */
static nrf_pwm_values_individual_t breath_values[BREATH_STEPS];
static nrf_pwm_sequence_t breath_seq = {
    .values = { .p_individual = breath_values },
    .length = NRF_PWM_VALUES_LENGTH(breath_values),
    .repeats = 40,    /* Hold each step ~40ms. Pulse duration: 64*40ms ≈ 2.6s */
    .end_delay = 0,
};

static void breath_timer_handler(struct k_timer *timer);
static K_TIMER_DEFINE(breath_timer, breath_timer_handler, NULL);

static void breath_pwm_handler(nrfx_pwm_evt_type_t event_type, void *p_context)
{
    if (event_type == NRFX_PWM_EVT_FINISHED) {
        /* Pulse complete — start timer for the pause */
        k_timer_start(&breath_timer, K_SECONDS(BREATH_PAUSE_S), K_NO_WAIT);
    }
}

static void breath_timer_handler(struct k_timer *timer)
{
    /* Pause complete — play one more pulse */
    if (pwm_breathing) {
        nrfx_pwm_simple_playback(&pwm_led, &breath_seq, 1, 0);
    }
}

static void breathing_led_init(void)
{
    /* Build breathing table. pin_inverted handles active-low LED,
     * so 0=off, BREATH_MAX_DUTY=max brightness. */
    for (int i = 0; i < BREATH_STEPS; i++) {
        int brightness = (i < 32) ? i : (63 - i);
        int duty = brightness * brightness * BREATH_MAX_DUTY / (31 * 31);
        breath_values[i].channel_0 = (uint16_t)duty;
        breath_values[i].channel_1 = 0;
        breath_values[i].channel_2 = 0;
        breath_values[i].channel_3 = 0;
    }

    nrfx_pwm_config_t config = {
        .output_pins = {
            NRF_GPIO_PIN_MAP(1, 3),  /* P1.03 = green LED */
            NRF_PWM_PIN_NOT_CONNECTED,
            NRF_PWM_PIN_NOT_CONNECTED,
            NRF_PWM_PIN_NOT_CONNECTED,
        },
        .pin_inverted = { true, false, false, false }, /* Active LOW LED */
        .irq_priority = NRFX_PWM_DEFAULT_CONFIG_IRQ_PRIORITY,
        .base_clock   = NRF_PWM_CLK_1MHz,
        .count_mode   = NRF_PWM_MODE_UP,
        .top_value    = 1000,
        .load_mode    = NRF_PWM_LOAD_INDIVIDUAL,
        .step_mode    = NRF_PWM_STEP_AUTO,
    };

    if (nrfx_pwm_init(&pwm_led, &config, breath_pwm_handler, NULL) == NRFX_SUCCESS) {
        /* Play a single-step "off" sequence to ensure LED starts dark.
         * Without this, the PWM idle state may leave the pin floating. */
        static nrf_pwm_values_individual_t off_val = { 0, 0, 0, 0 };
        static nrf_pwm_sequence_t off_seq = {
            .values = { .p_individual = &off_val },
            .length = NRF_PWM_VALUES_LENGTH(off_val),
            .repeats = 0,
            .end_delay = 0,
        };
        nrfx_pwm_simple_playback(&pwm_led, &off_seq, 1, 0);
        LOG_INF("Breathing LED: PWM0 on P1.03");
    }
}

static void breathing_led_start(void)
{
    if (!pwm_breathing) {
        pwm_breathing = true;
        nrfx_pwm_simple_playback(&pwm_led, &breath_seq, 1, 0); /* play once, handler restarts */
    }
}

static void breathing_led_stop(void)
{
    if (pwm_breathing) {
        pwm_breathing = false;
        k_timer_stop(&breath_timer);
        nrfx_pwm_stop(&pwm_led, false);
        /* PWM released — manually drive pin to turn LED off.
         * Active-low LED: HIGH = off */
        nrf_gpio_cfg_output(NRF_GPIO_PIN_MAP(1, 3));
        nrf_gpio_pin_set(NRF_GPIO_PIN_MAP(1, 3));
    }
}

static void led_set(bool on)
{
    /* P1.03 is now PWM-driven (breathing LED). Use breathing_led_start/stop instead.
     * This function kept for error state where we want solid on/off. */
    (void)on;
}

/* NeoPixel colors — LED0=status (problems only), LED1=activity */
#define NEO_OFF       0, 0, 0
#define NEO_RED       20, 0, 0
#define NEO_GREEN     0, 10, 0
#define NEO_BLUE      0, 0, 20
#define NEO_YELLOW    15, 10, 0
#define NEO_WHITE     30, 30, 30

/* NeoPixel functions — no-ops when LED_STRIP is disabled */
static void neopixel_set(uint8_t r0, uint8_t g0, uint8_t b0,
                          uint8_t r1, uint8_t g1, uint8_t b1)
{
#if defined(CONFIG_LED_STRIP)
    if (!led_strip) return;
    leds[0].r = r0; leds[0].g = g0; leds[0].b = b0;
    leds[1].r = r1; leds[1].g = g1; leds[1].b = b1;
    led_strip_update_rgb(led_strip, leds, 2);
#endif
    (void)r0; (void)g0; (void)b0; (void)r1; (void)g1; (void)b1;
}

static void neopixel_off(void)
{
    neopixel_set(0, 0, 0, 0, 0, 0);
}

