Bwooce/tinygs_nRF52/src/main.cpp
        uint32_t payload_len = MIN(pub->message.payload.len, sizeof(rx_payload) - 1);
        int ret = mqtt_read_publish_payload(client, rx_payload, payload_len);
        if (ret < 0) {
            LOG_ERR("MQTT payload read error: %d", ret);
            break;
        }
        rx_payload[ret] = '\0';

        LOG_INF("MQTT RX [%s] (%d bytes)", rx_topic, ret);
        /* Truncate long payloads for logging — full payload is still parsed */
        if (ret > 0) {
            char saved = 0;
            if (ret > 200) { saved = rx_payload[200]; rx_payload[200] = '\0'; }
            LOG_INF("  payload: %s%s", (char *)rx_payload, ret > 200 ? "..." : "");
            if (saved) { rx_payload[200] = saved; }
        }

        /* Extract command name from topic:
         * tinygs/global/cmnd/XXX or tinygs/user/station/cmnd/XXX */
        const char *cmnd = strstr(rx_topic, "/cmnd/");
        if (cmnd) {
            cmnd += 6;  /* skip "/cmnd/" */
            LOG_INF("  command: %s", cmnd);

            if (strcmp(cmnd, "begine") == 0 ||
                strcmp(cmnd, "batch_conf") == 0 ||
                strcmp(cmnd, "beginp") == 0) {
                if (radio != nullptr) {
                    /* Store raw payload as modem_conf before parsing
                     * (json_obj_parse modifies the buffer in-place) */
                    size_t conf_len = strlen((char *)rx_payload);
                    if (conf_len < sizeof(tinygs_radio.modem_conf)) {
                        memcpy(tinygs_radio.modem_conf, rx_payload, conf_len + 1);
                    } else {
                        LOG_WRN("modem_conf too large (%zu > %zu), skipped",
                                conf_len, sizeof(tinygs_radio.modem_conf) - 1);
                    }

                    /* Parse begine JSON via Zephyr json.h descriptors */
                    struct tinygs_begine_msg msg;
                    int64_t parsed = tinygs_parse_begine((char *)rx_payload, ret, &msg);
                    if (parsed < 0) {
                        LOG_ERR("begine parse failed");
                    } else {
                        /* Common fields */
                        float freq = tinygs_begine_get_freq(&msg);
                        if (freq > 100.0f && freq < 1000.0f) {
                            tinygs_radio.frequency = freq;
                        }

                        if (msg.sat) {
                            strncpy(tinygs_radio.satellite, msg.sat,
                                    sizeof(tinygs_radio.satellite) - 1);
                            tinygs_radio.satellite[sizeof(tinygs_radio.satellite) - 1] = '\0';
                        }
                        tinygs_radio.norad = (uint32_t)msg.NORAD;

                        bool is_fsk = msg.mode && strcmp(msg.mode, "LoRa") != 0;
                        strncpy(tinygs_radio.modem_mode,
                                is_fsk ? "FSK" : "LoRa",
                                sizeof(tinygs_radio.modem_mode) - 1);

                        if (!is_fsk) {
                            /* ---- LoRa mode ---- */
                            radio->setFrequency(freq + tinygs_radio.freq_offset / 1e6f);
                            float bw = tinygs_begine_get_bw(&msg);
                            if (bw > 0.0f) {
                                radio->setBandwidth(bw);
                                tinygs_radio.bw = bw;
                            }
                            if (msg.sf >= 5 && msg.sf <= 12) {
                                radio->setSpreadingFactor(msg.sf);
                                tinygs_radio.sf = msg.sf;
                            }
                            if (msg.cr >= 4 && msg.cr <= 8) {
                                radio->setCodingRate(msg.cr);
                                tinygs_radio.cr = msg.cr;
                            }
                            radio->setSyncWord(msg.sw);
                            radio->setPreambleLength(msg.pl);
                            tinygs_radio.pl = msg.pl;
                            tinygs_radio.crc_on = msg.crc;
                            tinygs_radio.fldro = msg.fldro;

                            if (msg.fldro == 2) {
                                radio->autoLDRO();
                            } else {
                                radio->forceLDRO(msg.fldro ? true : false);
                            }

                            radio->setCRC(msg.crc ? 2 : 0);
                            radio->invertIQ(msg.iIQ);
                            tinygs_radio.iIQ = msg.iIQ;

                            /* Implicit vs explicit header: ESP32 uses "len" field,
                             * NOT "cl". "cl" is content length for display.
                             * "len" defaults to 0 = explicit header. */
                            if (msg.len > 0) {
                                radio->implicitHeader(msg.len);
                            } else {
                                radio->explicitHeader();
                            }

                            radio->setRxBoostedGainMode(true);
                        } else {
                            /* ---- FSK mode ---- */
                            float bw = tinygs_begine_get_bw(&msg);
                            float fd = tinygs_begine_get_fd(&msg);
                            tinygs_radio.bw = bw;
                            tinygs_radio.bitrate = (float)msg.br;
                            tinygs_radio.freq_dev = fd;
                            tinygs_radio.ook = msg.ook;
                            tinygs_radio.fsk_len = msg.len;

                            int16_t rc = radio->beginFSK(
                                freq + tinygs_radio.freq_offset / 1e6f,
                                (float)msg.br / 1000.0f, /* kbps */
                                fd / 1000.0f,            /* kHz */
                                bw,                      /* kHz */
                                msg.pwr,
                                msg.pl,
                                LORA_TCXO_VOLTAGE);
                            if (rc != RADIOLIB_ERR_NONE) {
                                LOG_ERR("beginFSK failed: %d", rc);
                            }

                            /* Re-register DIO1 interrupt (beginFSK resets it) */
                            radio->setPacketReceivedAction(lora_rx_callback);

                            radio->setCRC(0); /* FSK HW CRC off — done in software */

                            if (msg.len > 0) {
                                radio->fixedPacketLengthMode(msg.len);
                            }

