Bwooce/tinygs_nRF52/src/main.cpp
        case STATE_MQTT_CONNECTED: {
            LOG_INF("MQTT connected, entering main loop");
            neopixel_off(); /* NeoPixels off when stable */
            breathing_led_start(); /* Green LED breathes when connected */

            /* Sync time via SNTP — needed for Doppler compensation */
            if (!time_synced) {
                sntp_sync();
            }

            /* TinyGS main loop — process MQTT, LoRa RX, and pings */
            uint32_t last_ping_ms = k_uptime_get_32();
            uint32_t last_status_log_ms = last_ping_ms;
            #define STATUS_LOG_INTERVAL_MS 300000 /* 5 minutes */

            while (app_state == STATE_MQTT_CONNECTED) {
                /* Poll MQTT socket for incoming data */
                int rc = zsock_poll(&mqtt_poll_fd, mqtt_poll_fd_count, 100);
                if (rc > 0) {
                    mqtt_input(&mqtt_client);
                }
                {
                    int live_ret = mqtt_live(&mqtt_client);
                    if (live_ret && live_ret != -EAGAIN) {
                        LOG_DBG("mqtt_live: %d", live_ret);
                    }
                }

                /* Check for LoRa packet reception */
                lora_check_rx();

                /* Update display (~every 100ms from poll timeout) */
                tinygs_display_update();

#if defined(CONFIG_IOT_LOG)
                /* Check for remote log listener beacons */
                iot_log_poll();
#endif

                /* Doppler compensation — every 4s if TLE available */
                uint32_t now_ms = k_uptime_get_32();
                if ((now_ms - last_doppler_ms) >= doppler_interval_ms) {
                    doppler_update();
                    last_doppler_ms = now_ms;
                }

                /* Send TinyGS ping (also serves as MQTT keepalive — see protocol doc) */
                if ((now_ms - last_ping_ms) >= (TINYGS_PING_INTERVAL_S * 1000)) {
                    tinygs_send_ping(&mqtt_client, cfg_mqtt_user, cfg_station);
                    last_ping_ms = now_ms;
                }

                /* Weblogin request via BOOT button */
                if (tinygs_display_weblogin_requested()) {
                    tinygs_send_weblogin_request(&mqtt_client, cfg_mqtt_user, cfg_station);
                }

                /* Track main thread stack high-water mark */
#if defined(CONFIG_INIT_STACKS) && defined(CONFIG_THREAD_STACK_INFO)
                {
                    static size_t stack_hwm = SIZE_MAX;
                    size_t unused = 0;
                    if (k_thread_stack_space_get(k_current_get(), &unused) == 0) {
                        if (unused < stack_hwm) stack_hwm = unused;
                    }
                }
#endif

                /* Periodic status log — every 5 minutes */
                if ((now_ms - last_status_log_ms) >= STATUS_LOG_INTERVAL_MS) {
                    uint32_t uptime_s = k_uptime_get_32() / 1000;
                    uint32_t conn_s = (now_ms - mqtt_connected_uptime_ms) / 1000;

                    /* Get main thread stack usage */
                    size_t stack_unused = 0;
                    size_t stack_size = CONFIG_MAIN_STACK_SIZE;
#if defined(CONFIG_INIT_STACKS) && defined(CONFIG_THREAD_STACK_INFO)
                    k_thread_stack_space_get(k_current_get(), &stack_unused);
#endif
                    size_t stack_used = stack_size - stack_unused;

#ifdef CONFIG_SYS_HEAP_RUNTIME_STATS
                    struct sys_memory_stats stats;
                    sys_heap_runtime_stats_get(&_system_heap.heap, &stats);
                    LOG_INF("STATUS: up=%us conn=%us mqtt_rx=%u lora_rx=%u "
                            "heap=%u/%u(peak=%u) stack=%u/%u "
                            "vbat=%dmV sat=%s",
                            (unsigned)uptime_s, (unsigned)conn_s,
                            (unsigned)mqtt_rx_count, (unsigned)lora_rx_count,
                            (unsigned)stats.allocated_bytes,
                            (unsigned)CONFIG_HEAP_MEM_POOL_SIZE,
                            (unsigned)stats.max_allocated_bytes,
                            (unsigned)stack_used, (unsigned)stack_size,
                            read_vbat_mv(),
                            tinygs_radio.satellite);
#else
                    LOG_INF("STATUS: up=%us conn=%us mqtt_rx=%u lora_rx=%u "
                            "stack=%u/%u vbat=%dmV sat=%s",
                            (unsigned)uptime_s, (unsigned)conn_s,
                            (unsigned)mqtt_rx_count, (unsigned)lora_rx_count,
                            (unsigned)stack_used, (unsigned)stack_size,
                            read_vbat_mv(),
                            tinygs_radio.satellite);
#endif
                    last_status_log_ms = now_ms;
                }

                k_msleep(100);  /* 100ms loop — responsive to LoRa packets */
            }
            break;
        }

        case STATE_ERROR:
            neopixel_set(NEO_RED,  NEO_OFF); /* Red = error */
            breathing_led_stop();
            led_set(false);
            LOG_ERR("Error state. Retrying in 30s...");
            k_msleep(30000);
            app_state = thread_attached ? STATE_DNS_RESOLVE : STATE_WAIT_THREAD;
            retry_count = 0;
            break;
        }
    }

    return 0;
}
